IdeaRS.OpenModel.Concrete.TypeDeflectionSheme
Scheme

IdeaRS.OpenModel.Concrete.TypeDeflectionSheme.DeflectionSheme_I
constant moment - single span

IdeaRS.OpenModel.Concrete.TypeDeflectionSheme.DeflectionSheme_II
one single force - single span

IdeaRS.OpenModel.Concrete.TypeDeflectionSheme.DeflectionSheme_III
single moment at the begging or end of the span - single span

IdeaRS.OpenModel.Concrete.TypeDeflectionSheme.DeflectionSheme_IV
two forces  - single span

IdeaRS.OpenModel.Concrete.TypeDeflectionSheme.DeflectionSheme_V
linear distributed loads - single span

IdeaRS.OpenModel.Concrete.TypeDeflectionSheme.DeflectionSheme_VI
triangle distributed loads - single span

IdeaRS.OpenModel.Concrete.TypeDeflectionSheme.DeflectionSheme_VII
linear distributed loads, moments in the left and right - continues beam

IdeaRS.OpenModel.Concrete.TypeDeflectionSheme.DeflectionSheme_VIII
one single force - cantilever

IdeaRS.OpenModel.Concrete.TypeDeflectionSheme.DeflectionSheme_IX
triangle distributed loads - cantilever

IdeaRS.OpenModel.Concrete.TypeDeflectionSheme.DeflectionSheme_X
one single force - non continues span

IdeaRS.OpenModel.Concrete.TypeDeflectionSheme.DeflectionSheme_XI
trapezoidal shape of loads